[
    {
        "title" : "Dani Fry Quartet / Date : 12-02-2015 / Time : 8:00pm - Tickets $7",
        "text" : "Dani has worked with many bands over her career including original funk group Hip-Popatamus,  jazz group Last 4 Bars and 60’s pop band Vonda Bouys & The Falsettos. She has toured with groups such as Epicure and Aurora Jane. She been a studio session singer on numerous albums and recorded many jingles for radio and television. In 2007 she was the winner of the Australian Idol My Mum Rocks competition. Dani will be joined by some of her favourite local jazz musicians to present an evening of her selection of beautiful jazz standards.",
        "link" : "",
        "image" : "http://suttonshouseofmusic.com.au/wp-content/uploads/2015/02/Dani.jpg"
    },
    {
        "title" : "Rockabilly weekend – The Itchy Fingers / Date : 13-02-2015 / Time : 8:00pm - FREE ENTRY",
        "text" : "Itchy Fingers are a 4 piece band playing 50’s & 60’s Rock’n’Roll, Rythym & Blues and Rockabilly. They have been gigging around Melbourne, Country Victoria and Interstate for more than 20 years now. Playing all sorts of functions from weddings to clubs and pubs to Festivals and classic car and hot rod shows. The best way to describe their music is played with a lot of OOOMPH!! Guaranteed to keep crowds dancing and toes Tapping. Current line up consists of; Domenic Raso - Lead Guitar and Vocals, Rob Monea - Rythym/Harmonica/vocals, Steve Virgona - Bass/ vocals and  Manuel Cuschieri = Drums Nothing gives them more enjoyment than seeing a packed dance floor bopping away to one of their tunes",
        "link" : "",
        "image" : "http://suttonshouseofmusic.com.au/wp-content/uploads/2015/01/IMG_4558Itchy-Fingers.jpg"
    },
    {
        "title" : "Rockabilly weekend – The Roadhouse Romeos / Date : 14-02-2015 / Time : 8:00pm - FREE ENTRY",
        "text" : "Formed over 10 years ago by veteran \"Roots\" guitarist Peter Baylor to showcase his original tunes and eclectic guitar style. The band plays a mix of Rockabilly, Western swing , Honkytonk and Hillbilly blues in their unique style .Peter's guitar playing has been heard extensively in Australia and overseas in Europe and The US with such bands as The Dancehall Racketeers , The Starliners, The Flatfoot Shakers, The Baylor Brothers, Mic Conway and The Stringbusters among many more. His international supports and tours include The Stray Cats, Bob Dylan, Flaco Jimenez, Dale Watson, Deke Dickerson, Rose Flores and Ronnie Dawson. Joining Peter in the band is the unique Rick Dempster on steel guitar and harmonica. They've been playing together since the early 80's in The Dancehall Racketeers.",
        "link" : "",
        "image" : "http://suttonshouseofmusic.com.au/wp-content/uploads/2015/01/Peter-Baylor13-%C2%A9GregNoakes.jpg"
    },
    {
        "title" : "Rockabilly weekend – The Mary Gardens / Date : 15-02-2015 / Time : 3:00pm - FREE ENTRY",
        "text" : "The Mary Gardens are a sisterly duo from Ballarat that play pieces inspired by and from a by-gone era. Their unique blend of harmonies accompanied by a lone resonator guitar complete a sound that is reminiscent of early blues and rock ‘n’ roll with a distinct acoustic twist. Inspired by artists from the 1920s right through until the 1960s, these two gals will have your toes tappin’ along to the tunes of yester-year.",
        "link" : "https://soundcloud.com/themarygardens/my-babe-ricky-nelson-cover",
        "image" : "http://suttonshouseofmusic.com.au/wp-content/uploads/2015/01/The-Mary-Gardens.jpg"
    },
    {
        "title" : "Rockabilly weekend – MickDogs Boneyard / Date : 15-02-2015 / Time : 6:00pm - FREE ENTRY",
        "text" : "Mick Dog’s Bone Yard is the old blues and rockabilly from the swamp and hot nights of the deep South. Full of conjure and deep back beat, The Boneyard bring hot Summer reverb up from the bubbling head waters of the funky old blues, the skins and reverb of the great 50’s styles where everything was getting ready to bust loose all over the World. The great shake of classic Rhythm and Blues, the wild abandon of early Rockabilly and the hypnotic groove of North Mississippi. That’s where it’s at! Formed in 2013, The Bone Yard with Mick Dog (the Wild man shaker and channeller of the Holy Ghost) and Dan Watson (The Sainted Mayor of Tom Tom City), have played across the land, hot nights in suburban Clubs full of cash and rolling eyes, five set break outs in remote Juke Joints, Festivals where they’ve jammed will V8 motors and roll",
        "link" : "",
        "image" : "http://suttonshouseofmusic.com.au/wp-content/uploads/2015/01/Bone-Yard-May-2014-17.jpg"
    },
    {
        "title" : "Sarah McLeod & Mick Skelton – Support Sean Miljoen / Date : 20-02-2015 / Time : 8:30pm - $20 presale $25 at the door",
        "text" : "Following on from her national tour with The Superjesus (supporting The Tea Party), the ever-exuberant Rock songstress SARAH McLEOD will team up with gun skins-man MICK SKELTON (Baby Animals) for a handful of shows.   Expect to hear these two perform a selection of songs from Sarah’s solo & Superjesus releases, along with a few fun covers & banter thrown in to boot.  Kicking off the night will be a performance from Sean Miljoen. TICKETS AVAILABLE FROM Suttons or Oztix",
        "link" : "",
        "image" : "http://suttonshouseofmusic.com.au/wp-content/uploads/2015/02/Sarah-McLeod-Mick-Skelton-December-2014.jpg"
    },
    {
        "title" : "The 3D’s / Date : 21-02-2015 / Time : 8:00pm - FREE ENTRY",
        "text" : "This four piece funk and groove originals band have played together for 4 years developing an understanding of funk and worked hard to get that sound they really love. Playing styles from James brown to Daft Punk to Michael Jackson, all which are executed in an inventive way. Influenced by Maceo Parker, Snarky Puppy and other funky artists, The 3D's have created their own style of playing and wish to take it as far as they can.",
        "link" : "",
        "image" : "http://suttonshouseofmusic.com.au/wp-content/uploads/2014/11/3ds-1.jpg"
    },
    {
        "title" : "Aine Tyrrell / Date : 26-02-2015 / Time : 8:00pm - Tickets $7",
        "text" : "Aine's music cradles the spirit of her native homeland, and tips the cap to a notable family history of Irish music tradition. Ache, honesty, and elated melodies, garnishing rhythms which a thousand years of ancestry have slammed foot to floor boards to, in both celebration and protest. Australia's historical lineage, and love of all things Irish, stands as testament to the accolades and support she is now garnering here in her new homeland, having procured the honour of Queenscliff Music festivals 'Emerging Talent 2014' mantle, along with receiving the invaluable and ongoing mentorship from our own revered songstress, Clare Bowditch. Aine's journey has only just begun as this unique talent continues to infiltrate the hearts and minds of music lovers everywhere.",
        "link" : "http://www.ainetyrrell.com/home",
        "image" : "http://suttonshouseofmusic.com.au/wp-content/uploads/2015/02/Aine.jpg"
    },
    {
        "title" : "Ballarat Ska Union / Date : 27-02-2015 / Time : 8:00pm - Tickets $5",
        "text" : "What is Ska? Ska is hip dance music originating in Jamaica in the 1960’s. Ballarat Ska Union will get you jumping, moving and grooving with its big dance sound. If you loved local legends like The Boxing Tostados and The Big Fat Skank, you will love BSO. Ballarat Ska Orchestra features Stella Savy on vocals and guitar, Bryn Hills wailing on trombone, Mick Timcke, John “JD” Davey and Pat Emery rounding out the horn section. Mr Wayne Parker skanks on guitar and Barry Deenick, Geoff Hassall and Andrew “Vinnie” Vincent form the backbone of a super-tight rhythm section. With musicians seasoned by illustrious bands such as Bomba, Melbourne Ska Orchestra, Los Locos, Brother Popcorn, Busta Mento, The Boxing Tostados, The Big Fat Skank and Insectgirl, What could go wrong?",
        "link" : "",
        "image" : "http://suttonshouseofmusic.com.au/wp-content/uploads/2015/01/Ballarat-Ska.jpg"
    },
    {
        "title" : "Vonda Bouys & The Falsettos / Date : 06-03-2015 / Time : 8:00pm - Tickets $10",
        "text" : "When Vonda Bouys first met the Falsettos, there was an explosion of false eyelashes, spectacles and skivvies. The band mysteriously appeared on the music scene in mid 2011, playing all the favourite 60s dance classics and Vonda and the boys leave a trail of dreamy-eyed Go Go dancers behind them. The band features Vonda Bouys (Dani Fry) on vocals, Ian Toff Riethoff on double bass, Bangin Bryn Hills on trombone, Josh Hot Lips Woods on Saxophone, Damien Woodsy Woods on keys and Ambling Al Lethlean on drums.",
        "link" : "http://www.vondabouysandthefalsettos.com/",
        "image" : "http://suttonshouseofmusic.com.au/wp-content/uploads/2014/12/Vonda-Vintage2.jpg"
    },
    {
        "title" : "Pugsley Buzzard Trio / Date : 07-03-2015 / Time : 8:00 pm - FREE ENTRY",
        "text" : "Pugsley Buzzard continues to dazzle audiences far and wide with his deep funky grooves, rollicking boogie, blazing stride and dark hoodoo blues. With a voice that can make ladies sigh and grown men cry, his performances are guaranteed to booglarize ya and get ya jumpin'. Pugsley has just returned from a hugely successful Summer Festival Tour in Europe and USA promoting his latest album Chasin' Aces that was recorded in the Crescent City last year. A Suttons favourite, Bugsley will return with his band!",
        "link" : "http://www.pugsleybuzzard.com/",
        "image" : "http://suttonshouseofmusic.com.au/wp-content/uploads/2014/10/IMG_8041-half.jpg"
    },
    {
        "title" : "Neil Murray – Supported By: Rachael Taylor / Date : 21-03-2015 / Time : 8:00pm - Tickets $25",
        "text" : "NEIL MURRAY first appeared in the early eighties as a founding member of the Warumpi Band, which over three albums (Big Name, No Blankets, Go Bush, Too Much Humbug) and twenty years of performing propelled contemporary indigenous music into mainstream Australia, yielding such classic songs as My Island Home,Blackfella Whitefella, Fitzroy Crossing, Jailanguru Pakarnu, Stompin Ground, From the Bush and Waru. TICKETS AVAILABLE FROM Suttons or trybooking.com",
        "link" : "",
        "image" : "http://suttonshouseofmusic.com.au/wp-content/uploads/2015/01/Neil_Murray.jpg"
    },
    {
        "title" : "AMPED / Date : 17-02-2015 / Time : 4:00pm - 5:30pm - FREE ENTRY",
        "text" : "An Industry Based Opportunity for student studying VCE or VET Music in the Ballarat area. Every Tuesday during the school term, you can watch weekly live performances from Ballarat's up and coming musicians. AMPED is an alcohol free event!",
        "link" : "",
        "image" : "http://suttonshouseofmusic.com.au/wp-content/uploads/2015/02/Amped-Poster-smaller.jpg"
    }
]